---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecks
source: html/df5cd644-4610-de29-1367-ffcaea3bd2b2.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecks Property

The property labeled "Flecks" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintFlecks { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFlecksType".